In [6]:
import pymysql
import pandas as pd

con = pymysql.connect(host='localhost',
                      port=3306,
                      user='temp',
                      password='1q2w3e4r',
                      database='study',
                      charset='utf8mb4')
cur = con.cursor()
# cur.execute('create table student(id int not null, name varchar(16), email varchar(32), phone varchar(16), major varchar(16))')
table = 'student'
cols = 'id int not null, name varchar(16), email varchar(32), phone varchar(16), major varchar(16)'
cur.execute(f'create table {table}({cols})')

cur.execute('insert into student values(1, "이종혁", "xhxhfh333@hanmail.net", "010-6239-79222", "일반행정")')
cur.execute('select * from student')
print('first\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('update student set email="wonder1ng@velog.io" where id=1')
cur.execute('select * from student')
print('second\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('delete from student where id=1')
cur.execute('select * from student')
print('third\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('desc student')
print('third\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('drop table student')
con.close()

In [1]:
from StartSQL import StartSQL

tmp = StartSQL('temp', '1q2w3e4r', 'study')
cols = 'id int not null, name varchar(16), email varchar(32), phone varchar(16), major varchar(16)'
tmp.create_table('student', cols)
tmp.select_table('student')
tmp.insert(1,'이종혁','xhxhfh333@hanmail.net','010-6239-7922','일반행정')
manyList = [[2, '이종혁2', 'xhxhfh333@velog.io', '010-1234-5678','행정경찰학부'],
            [3, '이종혁3', 'xhxhfh333@gamil.com', '0106239-7922','이과']]
tmp.insert_many(manyList)

True

In [2]:
tmp.select()

   0     1                      2              3       4
0  1   이종혁  xhxhfh333@hanmail.net  010-6239-7922    일반행정
1  2  이종혁2     xhxhfh333@velog.io  010-1234-5678  행정경찰학부
2  3  이종혁3    xhxhfh333@gamil.com   0106239-7922      이과

In [3]:
tmp.select('*',1)

   0    1                      2              3     4
0  1  이종혁  xhxhfh333@hanmail.net  010-6239-7922  일반행정

In [4]:
tmp.select('id',1)

   0
0  1

In [5]:
tmp.update('None','email',1)
tmp.select()

   0     1                    2              3       4
0  1   이종혁                 None  010-6239-7922    일반행정
1  2  이종혁2   xhxhfh333@velog.io  010-1234-5678  행정경찰학부
2  3  이종혁3  xhxhfh333@gamil.com   0106239-7922      이과

In [6]:
tmp.delete(2)
tmp.select()

   0     1                    2              3     4
0  1   이종혁                 None  010-6239-7922  일반행정
1  3  이종혁3  xhxhfh333@gamil.com   0106239-7922    이과

In [7]:
tmp.end()